Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidStartLevelRamp Property
 The start level and end level for this ramp must be at different elevations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidStartLevelRamp { get; }
Public Shared ReadOnly Property InvalidStartLevelRamp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidStartLevelRamp {
	FailureDefinitionId^ get ();
}
static member InvalidStartLevelRamp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace